KlausMu/esp32-fan-controller/src/config.h
// --- tft ----------------------------------------------------------------------------------------------------------------------------------

#ifdef useTFT
#define TFT_CS                GPIO_NUM_5    //diplay chip select
#define TFT_DC                GPIO_NUM_4    //display d/c
#define TFT_RST               GPIO_NUM_22   //display reset
#define TFT_MOSI              GPIO_NUM_23   //diplay MOSI
#define TFT_CLK               GPIO_NUM_18   //display clock


#ifdef DRIVER_ILI9341
#define TFT_LED               GPIO_NUM_15   //display background LED
#define TFT_MISO              GPIO_NUM_19   //display MISO
#define TFT_ROTATION          3 // use 1 (landscape) or 3 (landscape upside down), nothing else. 0 and 2 (portrait) will not give a nice result.
#endif
#ifdef DRIVER_ST7735
#define TFT_ROTATION          1 // use 1 (landscape) or 3 (landscape upside down), nothing else. 0 and 2 (portrait) will not give a nice result.
#endif

#endif

// --- touch --------------------------------------------------------------------------------------------------------------------------------

// Only AZ-Touch: here you have to set the pin for TOUCH_IRQ. The older "ArduiTouch" and the newer "AZ-Touch" use different pins. And you have to set the LED-PIN to different values to light up the TFT.
// 1. "ArduiTouch" 2.4 inch (older version)
// https://www.az-delivery.de/en/products/az-touch-wandgehauseset-mit-touchscreen-fur-esp8266-und-esp32
#ifdef useTFT
// #define LED_ON           LOW          // override it in file "config_override.h"
#endif
#ifdef useTouch
// #define TOUCH_CS         GPIO_NUM_14  // override it in file "config_override.h"
// #define TOUCH_IRQ        GPIO_NUM_2   // override it in file "config_override.h"
#endif
// 2. "AZ-Touch" 2.8 inch, since November 2020
// https://www.az-delivery.de/en/products/az-touch-wandgehauseset-mit-2-8-zoll-touchscreen-fur-esp8266-und-esp32
// https://www.az-delivery.de/en/blogs/azdelivery-blog-fur-arduino-und-raspberry-pi/az-touch-mod
#ifdef useTFT
#define LED_ON           HIGH          // override it in file "config_override.h"
#endif
#ifdef useTouch
#define TOUCH_CS         GPIO_NUM_14   // override it in file "config_override.h"
#define TOUCH_IRQ        GPIO_NUM_27   // override it in file "config_override.h"
#endif

// sanity check
#if defined(useTouch) && !defined(useTFT)
static_assert(false, "You have to use \"#define useTFT\" when having \"#define useTouch\"");
#endif
#if defined(DRIVER_ST7735) && defined(useTouch)
static_assert(false, "TFT ST7735 doesn't support touch. Please disable it.");
#endif
#if !defined(useTouch) && !defined(useMQTT)
static_assert(false, "You cannot disable both MQTT and touch, otherwise you cannot control the fan");
#endif

// --- shutdown Raspberry Pi and power off --------------------------------------------------------------------------------------------------
/* Shutdown Raspberry Pi and turn off wifi power socket.
   In my setting I have a Raspberry Pi running Octoprint, a 3D printer, and both is powered by a wifi power socket.
   I wanted to shutdown the Pi and turn off power by means of the ESP32.
   This is very special to my setting. You can completely disable it.
   If this option is enabled, then a power off button is shown on the TFT screen.
   When you hit the button, a http request is send to OpenHab which starts a script (script has to be defined in OpenHab) with the following actions:
   - shutdown Raspberry Pi
   - wait 30 seconds
   - turn off wifi power socket (switch off 3D printer and Raspberry Pi)
   Since the OpenHab script (in my case) waits 30 seconds before turning off power, there is a simple countdown with same duration on the TFT display.
   The ESP32 does not need to turn off exactly when 0 is shown on the display. This depends on when the OpenHab script turns off the wifi power socket.
   ESP32 can actually power off when countdown is e.g. at 5 or even less than 0 ...
*/

#ifdef showShutdownButton
#define SHUTDOWNREQUEST                "http://<IPAddressOfYourHAserver:8123>/api/services/input_button/press" // override it in file "config_override.h"
#define SHUTDOWNPAYLOAD                "{\"entity_id\": \"input_button.3dprinter_shutdown\"}"                  // override it in file "config_override.h"
#define SHUTDOWNHEADERNAME1            "Authorization"                                                         // override it in file "config_override.h"
#define SHUTDOWNHEADERVALUE1           "Bearer <your bearer token>"                                            // override it in file "config_override.h"
#define SHUTDOWNHEADERNAME2            "Content-Type"                                                          // override it in file "config_override.h"
#define SHUTDOWNHEADERVALUE2           "application/json"                                                      // override it in file "config_override.h"
#define SHUTDOWNCOUNTDOWN              30  // in seconds
#endif

// sanity check
#if defined(showShutdownButton) && !defined(useWIFI)
static_assert(false, "You have to use \"#define useWIFI\" when having \"#define showShutdownButton\"");
#endif
#if defined(showShutdownButton) && !defined(useTouch)
static_assert(false, "You have to use \"#define useTouch\" when having \"#define showShutdownButton\"");
#endif

// --- not used -----------------------------------------------------------------------------------------------------------------------------
#ifdef DRIVER_ILI9341
// Occupied by AZ-touch. This software doesn't use this pin
#define BUZZER                GPIO_NUM_21
// #define A0                   GPIO_NUM_36
#endif

// --- include override settings from seperate file ---------------------------------------------------------------------------------------------------------------
#if __has_include("config_override.h")
  #include "config_override.h"
#endif

#endif /*__CONFIG_H__*/
